UB_Copy/src/Documents/УБ_ПланированиеЦелейИПоказателей/УБ_ПланированиеЦелейИПоказателей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УБ_ПланированиеЦелейИПоказателей</name>
  <registerRecords>InformationRegister.УБ_ПланПоПоказателям</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктураПредприятия</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>DefinedType.УБ_Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Руководитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Утвержден</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Горизонт</name>
    <comment>Горизонт планирования</comment>
    <type>
      <types>CatalogRef.УБ_ГоризонтыПланирования</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Утверждает</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Назначения</name>
    <attributes>
      <name>Цель</name>
      <type>
        <types>CatalogRef.УБ_Цели</types>
      </type>
    </attributes>
    <attributes>
      <name>Назначение</name>
      <type>
        <types>DefinedType.УБ_НазначенияПоказателей</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <comment>с таблицей Показатели по периодам</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НазначениеТип</name>
      <type>
        <types>DefinedType.УБ_НазначенияПоказателей</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Показатели</name>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>CatalogRef.УБ_ПоказателиЭффективности</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <comment>с таблицей Назначения</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПериодичностьПланирования</name>
      <type>
        <types>EnumRef.УБ_ПериодыРасчетаМоделиПланирования</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>DefinedType.УБ_ЗначенияПоказателей</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиноеЗначениеПоказателя</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>РазбитьНаПериоды</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СчитатьНарастающийИтог</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязиСПериодом</name>
      <comment>с таблицей Показатели по периодам</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НегативноеОтклонениеНормыДо</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПограничноеОтклонениеНормыОт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПограничноеОтклонениеНормыДо</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПозитивноеОтклонениеНормыОт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПериодичностьКонтроля</name>
      <type>
        <types>EnumRef.УБ_ПериодыРасчетаМоделиПланирования</types>
      </type>
    </attributes>
    <attributes>
      <name>Календарь</name>
      <type>
        <types>CatalogRef.Календари</types>
      </type>
    </attributes>
    <attributes>
      <name>НастройкиКонтроляЗаполнены</name>
      <comment>для контроля показателя указан отдельный набор сотрудников</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Цель</name>
      <type>
        <types>CatalogRef.УБ_Цели</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПоказателиПоПериодам</name>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекущееЗначение</name>
      <type>
        <types>DefinedType.УБ_ЗначенияПоказателей</types>
      </type>
    </attributes>
    <attributes>
      <name>НарастающийИтог</name>
      <type>
        <types>DefinedType.УБ_ЗначенияПоказателей</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязиСПериодом</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

UB_Copy/src/Documents/УБ_ПланированиеЦелейИПоказателей/Forms/ФормаСписка/Module.bsl
#Область ОбработчикиСобытийФормы
	
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УБ_СобытияФорм.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	УстановитьУсловноеОформление();
	// СтандартныеПодсистемы.ПодключаемыеКомагды         
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	//Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры  

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)

    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

#Область СтандартныеПодсистемы_ПодключаемыеКоманды

&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Элементы.Список);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Элементы.Список, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Список);
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	СтандартныеПодсистемыСервер.УстановитьУсловноеОформлениеПоляДата(ЭтотОбъект, "Список.Дата", Элементы.Дата.Имя);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура Подключаемый_ПриИзмененииЭлемента(Элемент)
	СохраняемыеВНастройкахДанныеМодифицированы = Истина; // !!! зачем?
	ОтборПриИзмененииНаСервере(Элемент.Имя);
КонецПроцедуры   

&НаСервере
Процедура ОтборПриИзмененииНаСервере(Элемент)
	УБ_СобытияФорм.ПриИзмененииЭлемента(ЭтотОбъект, Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ГоризонтПланированияОтборПриИзменении(Элемент)
	СохраняемыеВНастройкахДанныеМодифицированы = Истина;
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Список,
		"Горизонт",
		ГоризонтПланирования,
		ВидСравненияКомпоновкиДанных.Равно,
		,
		ЗначениеЗаполнено(ГоризонтПланирования));
КонецПроцедуры

&НаКлиенте
Процедура КонтролируетОтборПриИзменении(Элемент)
	СохраняемыеВНастройкахДанныеМодифицированы = Истина;
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Список,
		"Ответственный",
		Контролирует,
		ВидСравненияКомпоновкиДанных.Равно,
		,
		ЗначениеЗаполнено(Контролирует));
КонецПроцедуры

&НаКлиенте
Процедура УтверждаетОтборПриИзменении(Элемент)
	СохраняемыеВНастройкахДанныеМодифицированы = Истина;
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Список,
		"Утверждает",
		Утверждает,
		ВидСравненияКомпоновкиДанных.Равно,
		,
		ЗначениеЗаполнено(Утверждает));
КонецПроцедуры

#КонецОбласти
